Layer (type)                 Output Shape              
=================================================
conv2d_1 (Conv2D)            (None, 96, 96, 32)  
_________________________________________________
activation_1 (Activation)    (None, 96, 96, 32)  
_________________________________________________
batch_normalization_1 (Batch (None, 96, 96, 32)  
_________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 32, 32, 32)  
_________________________________________________
dropout_1 (Dropout)          (None, 32, 32, 32)  
_________________________________________________
conv2d_2 (Conv2D)            (None, 32, 32, 64)  
_________________________________________________
activation_2 (Activation)    (None, 32, 32, 64)  
_________________________________________________
batch_normalization_2 (Batch (None, 32, 32, 64)  
_________________________________________________
conv2d_3 (Conv2D)            (None, 32, 32, 64)  
_________________________________________________
activation_3 (Activation)    (None, 32, 32, 64)  
__________________________________________________
batch_normalization_3 (Batch (None, 32, 32, 64)   
__________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 16, 16, 64)   
__________________________________________________
dropout_2 (Dropout)          (None, 16, 16, 64)   
__________________________________________________
conv2d_4 (Conv2D)            (None, 16, 16, 128)  
__________________________________________________
activation_4 (Activation)    (None, 16, 16, 128)  
__________________________________________________
batch_normalization_4 (Batch (None, 16, 16, 128)  
__________________________________________________
conv2d_5 (Conv2D)            (None, 16, 16, 128)  
__________________________________________________
activation_5 (Activation)    (None, 16, 16, 128)  
__________________________________________________
batch_normalization_5 (Batch (None, 16, 16, 128)  
__________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 8, 8, 128)    
__________________________________________________
dropout_3 (Dropout)          (None, 8, 8, 128)    
__________________________________________________
flatten_1 (Flatten)          (None, 8192)         
__________________________________________________
dense_1 (Dense)              (None, 1024)         
__________________________________________________
activation_6 (Activation)    (None, 1024)         
__________________________________________________
batch_normalization_6 (Batch (None, 1024)         
__________________________________________________
dropout_4 (Dropout)          (None, 1024)         
__________________________________________________
dense_2 (Dense)              (None, 3)            
__________________________________________________
activation_7 (Activation)    (None, 3)            